---
kind: method
id: M:Autodesk.Revit.Attributes.TransactionAttribute.#ctor(Autodesk.Revit.Attributes.TransactionMode)
source: html/1db73de1-cb03-d0dc-41f9-0f4f0efb7b97.htm
---
# Autodesk.Revit.Attributes.TransactionAttribute.#ctor Method

Constructs a new TransactionAttribute.

## Syntax (C#)
```csharp
public TransactionAttribute(
	TransactionMode mode
)
```

## Parameters
- **mode** (`Autodesk.Revit.Attributes.TransactionMode`)